import greenfoot.*;  // (World, Actor, GreenfootImage, Greenfoot and MouseInfo)
import java.io.*;

/**
 * Write a description of class WrittenText here.
 * 
 * @author (your name) 
 * @version (a version number or a date)
 */
public class WrittenText implements Serializable
{
    
    String debuggerMsg = "Έχασες ενέργεια!\n\nΠροσπάθησε ξανά ή μίλα πάλι μαζί μου\nγια βοήθεια.";
    /**
     * Act - do whatever the WrittenText wants to do. This method is called whenever
     * the 'Act' or 'Run' button gets pressed in the environment.
     */
    public WrittenText(){
    }  

    //level_0
    public String welcomeMsgL0(){
        return "Καλώς ήρθες στον πλανήτη μου Methodius!\n\nΕίμαι ο πλανητάρχης Methodis και μπορώ \nνα σε "+
        "βοηθήσω να φύγεις αρκεί να κάνεις \nκάτι για μένα.";
    }

    public String taskText1L0(){
        return "Το χωριό μου δέχτηκε επίθεση από το\nφοβερό εχθρό DragonDrop.\n\nΚατέστρεψε όλα τα σπίτια μας και"+ 
        "\nμας πήρε όλες τις προμήθειες.";
    }

    public String taskText2L0(){
        return "Όλοι οι κάτοικοι έφυγαν από τον\nMethodius, όμως εγώ έμεινα πίσω\nγια να ξαναχτίσω το χωριό."
        +"\n\nΒοήθησέ με να φτιάξω το σπίτι μου,\nώστε να επιστρέψουν οι Μεθοδιανοί πίσω.";
    }

    public String taskText3L0(){
        return "Αρχικά, πρέπει να μαζέψεις πρώτες ύλες\n"
        +"και έπειτα να τις χρησιμοποιήσεις."
        +"\nΓια να το πετύχεις αυτό, πρέπει να\nαποκτήσεις"
        +" δύο νέες δυνάμεις!"
        +"\nΗ διαδικασία, αυτή, μοιάζει πολύ με την\nκλήση μεθόδων (methods) στον"
        +" κόσμο\nτων προγραμματιστών.";
    }

    public String taskText4L0(){
        return "Η δύναμη για να χρησιμοποιείς είναι: use();"
        +"\nΗ δύναμη για να μαζεύεις είναι η: pickUp();"
        +"\npickUp  -> το όνομα της μεθόδου."
        +"\nΟι παρενθέσεις συνοδεύουν πάντα το\nόνομα της μεθόδου."
        +"\nΤο ερωτηματικό μπαίνει απαραίτητα στο\nτέλος κάθε γραμμής κώδικα!";
    }

    public String taskText5L0(){
        return "Οι δυνάμεις πλέον σου ανήκουν.\nΓια να λειτουργήσουν σωστά"
        +" χρειάζονται\nτο όνομά σου: Alex.pickUp();"
        +"\n\nΤα ΚΕΦΑΛΑΙΑ και τα πεζά γράμματα,\nέχουν σημασία!";
    }

    public String taskText6L0(){
        return "Οι λάθος απαντήσεις θα σου κοστίσουν\nενέργεια."
        +"\n\nΦυλάξου από τη βροχή μετεωριτών που\nπλησιάζει!";
    }

    public String toFixHouse(){
        return "Χρειάζομαι 2 ξύλα και 2 τούβλα για να φτιάξω το\nσπίτι του Methodius.";
    }

    public String allMaterial(){
        return "Έχω όλα τα υλικά.\nΤώρα θα πρέπει να τα χρησιμοποιήσω.";
    }
    
    public String wellDone(){
        return "Τα κατάφερες!\n\nΟι Μεθοδιανοί σου είναι ευγνώμονες.\nΤώρα μπορείς να αποχωρήσεις"
        +" από τον\nMethodis.\n\nLive long and prosper!";
    }
    
    public String youLost(){
        return "Έχασες όλη σου την ενέργεια!\nΞαναπροσπάθησε!";
    }
    
    
   //level_02
       public String welcomeMsgL02(){
        return "Καλώς ήρθες στον πλανήτη μου NewOB!\n\nΕίμαι ο πλανητάρχης NewObis και μπορώ \nνα σε "+
        "βοηθήσω να φύγεις αρκεί να κάνεις \nκάτι για μένα.";
    }

    public String taskText1L02(){
        return "Το χωριό μου δέχτηκε επίθεση από το\nφοβερό εχθρό DragonDrop.\n\nΚατέστρεψε τη μοναδική γέφυρα"+ 
        "\nπου οδηγεί στο σπίτι μου.";
    }

    public String taskText2L02(){
        return "Βοήθησέ με να φτιάξω τη γέφυρα,ώστε\nνα μπορέσω να επιστρέψω σπίτι μου."+
        "\n\nΣε αντάλλαγμα θα σου δώσω νέες\nδυνάμεις.";
    }

    public String taskText3L02(){
        return "Για να φτιάξεις τη γέφυρα χρειάζεσαι\nΠηλό και Ξύλο.\n"
        +"Προκειμένου να λάβεις αυτές τις πρώτες\nύλες, θα πρέπει να τις δημιουργήσεις."
        +"\nΗ διαδικασία, αυτή, μοιάζει πολύ με τη\nδημιουργία αντικειμένων (objects)\nστον"
        +" κόσμο των προγραμματιστών.";
    }

    public String taskText4L02(){
        return "Κάθε πινακίδα απεικονίζει μια πρώτη ύλη,\nή αλλιώς, μια κλάση."
        +" Για παράδειγμα:\nη κλάση Ξύλο, η κλάση Πηλός."
        +"\nΧρησιμοποιώντας την εντολή new Wood();\nμπορείς να δημιουργήσεις αντικείμενα της\nκλάσης αυτής. ";
    }

    public String taskText5L02(){
        return "new όνομα_κλάσης();\n-Το \"new\" υποδηλώνει τη δημιουργία του\nνέου αντικειμένου, οποιασδήποτε κλάσης."
        +"\n-Οι παρενθέσεις συνοδεύουν πάντα το\nόνομα της κλάσης.\n-Το ερωτηματικό μπαίνει απαραίτητα στο\nτέλος κάθε γραμμής κώδικα!";
    }

    public String taskText6L02(){
        return "Μια ακόμα νέα δύναμη είναι η useAll();\nΓια να λειτουργήσει σωστά"
        +" χρειάζεται\nτο όνομά σου.\nΧρησιμοποίησέ την σοφά!"
        +"\n\n";
    }
    
    public String wellDonelvl2(){
        return "Τα κατάφερες! \nΜπορείς να επισκεφθείς το σπίτι μου\nπριν φύγεις.";
    }

    //level_1
    public String brokenHut(){

        return "Η καλύβα αυτή φαίνεται ετοιμόρροπη.\nΚαλύτερα να τη φτιάξω πριν μπω.";
    }

    public String enteringRoom(){
        return "Είσοδος στο σπίτι...";
    }

    public String exitRoom(){
        return "Έξοδος...";
    }

    public String roomEntranceText(){
        return "Τι περίεργο σπίτι! \nΑ να κι ένα πλάσμα!\nΑς του μιλήσω, μπορεί να με βοηθήσει.";
    }

    public String welcomeMsg(){
        return "Καλώς ήρθες στον πλανήτη μου Objectus!\n\nΕίμαι ο πλανητάρχης Objectis και μπορώ \nνα σε "+
        "βοηθήσω να φύγεις αρκεί να κάνεις \nκάτι για μένα.";
    }

    public String taskText1(){
        return "Υπάρχουν δύο καλύβες έξω, οι οποίες \nχρειάζονται ανακατασκευή.\n\n"+
        "Για να τις φτιάξεις θα χρειαστείς τις\nεξής πρώτες ύλες:\nΞύλο, Πηλό και Άχυρο.";
    }

    public String taskText2(){
        return "Προκειμένου να λάβεις αυτές τις πρώτες\nύλες, θα πρέπει να τις δημιουργήσεις."
        +"\n\nΗ δημιουργία πρώτων υλών, μοιάζει πολύ\nμε τη δημιουργία αντικειμένων (objects)\nστον"
        +" κόσμο των προγραμματιστών.";
    }

    public String taskText3(){
        return "Αρχικά, ας ονομάσουμε τις πρώτες ύλες,\n\"κλάσεις\"."
        +"\n\nΓια παράδειγμα:\nη κλάση Ξύλο,\nη κλάση Πηλός,\nη κλάση Άχυρο.";
    }

    public String taskText4(){
        return "Στη συνέχεια, για να δημιουργήσεις\nκάποια πρώτη ύλη, αρκεί να \"καλέσεις\""
        +"\nτην αντίστοιχη κλάση ως εξής:\n\n π.χ\n new Wood();\n new Clay();";
    }

    public String taskText5(){
        return "new όνομα_κλάσης();\n\n-Το \"new\" υποδηλώνει τη δημιουργία του\nνέου αντικειμένου, οποιασδήποτε κλάσης."
        +"\n-Οι παρενθέσεις συνοδεύουν πάντα το\nόνομα της κλάσης.\n-Το ερωτηματικό μπαίνει απαραίτητα στο\nτέλος κάθε γραμμής κώδικα!";
    }

    public String taskText6(){
        return "Είσαι έτοιμος για την αποστολή σου.\n\nΘυμήσου!\nnew όνομα_κλάσης();\n\nΗ δημιουργία αντικειμένων θα σου\nανοίξει πολλές πόρτες... ";
    }

    public String lockedDoor(){
        return "Είναι κλειδωμένη...\n\nΆραγε μπορώ να την ανοίξω...;";
    }  
}
